from matplotlib import pyplot

exp_1 = [3708.0, 10359.0, 23511.0, 46567.0, 95378.0, 182755.0, 375698.0, 772170.0, 1782561.0, 4527435.0, 8755046.0, 17898560.0, 35535899.0]
exp_2 = [3385.0, 7425.0, 15309.0, 28928.0, 49917.0, 76128.0, 122651.0, 189843.0, 297373.0, 494614.0, 863479.0, 2345609.0, 4607260.0]
new = [exp_1[i]/exp_2[i] for i in range(13)]
fig, ax = pyplot.subplots()
line_up, = ax.plot([i for i in range(1, 14)], new)
ax.set_ylabel("Отношение времен")
ax.set_xlabel("Степень М")
# pyplot.yscale('log')
ax.set_title("Отношение времени эксп. поиска на \nлинейных данных к времени на эксп. данных")
pyplot.show()